In [1]:
import pandas as pd

gitCloudRepo='https://github.com/PUBPOL-542/deliverableI/raw/main/'
fileName="export.csv"

DFcsv1=pd.read_csv(gitCloudRepo + fileName)

In [2]:
DFcsv1

,name,slug,value,date_of_information,ranking,region
0,Afghanistan,afghanistan,104.89,NaN,1,South Asia
1,Somalia,somalia,86.53,NaN,2,Africa
2,Central African Republic,central-african-republic,82.97,NaN,3,Africa
3,Equatorial Guinea,equatorial-guinea,78.33,NaN,4,Africa
4,Sierra Leone,sierra-leone,73.42,NaN,5,Africa
...,...,...,...,...,...,...
222,Japan,japan,1.90,NaN,223,East and Southeast Asia
223,Monaco,monaco,1.76,NaN,224,Europe
224,Iceland,iceland,1.65,NaN,225,Europe
225,Singapore,singapore,1.55,NaN,226,East and Southeast Asia
226,Slovenia,slovenia,1.52,NaN,227,Europe

In [4]:
import pandas as pd

gitCloudRepo='https://github.com/PUBPOL-542/deliverableI/raw/main/e'
fileName="xport-2.csv"

DFcsv2=pd.read_csv(gitCloudRepo + fileName)

In [5]:
DFcsv2

,name,slug,value,date_of_information,ranking,region
0,Yemen,yemen,39.9,2013,1,Middle East
1,Timor-Leste,timor-leste,37.5,2013,2,East and Southeast Asia
2,India,india,33.4,2016/18,3,South Asia
3,Sudan,sudan,33.0,2014,4,Africa
4,Niger,niger,31.3,2019,5,Africa
...,...,...,...,...,...,...
125,Chile,chile,0.5,2014,126,South America
126,Germany,germany,0.5,2014/17,127,Europe
127,Estonia,estonia,0.4,2013/15,128,Europe
128,Portugal,portugal,0.4,2015/16,129,Europe
129,United States,united-states,0.4,2017/18,130,North America

In [6]:
import pandas as pd

gitCloudRepo='https://github.com/PUBPOL-542/deliverableI/raw/main/e'
fileName="xport-3.csv"

DFcsv3=pd.read_csv(gitCloudRepo + fileName)

In [7]:
DFcsv3

,name,slug,value,date_of_information,ranking,region
0,Serbia,serbia,16.39,2022 est.,1,Europe
1,Romania,romania,15.26,2022 est.,2,Europe
2,Lithuania,lithuania,15.12,2022 est.,3,Europe
3,Latvia,latvia,14.65,2022 est.,4,Europe
4,Bulgaria,bulgaria,14.41,2022 est.,5,Europe
...,...,...,...,...,...,...
224,Gaza Strip,gaza-strip,2.91,2022 est.,225,Middle East
225,Bahrain,bahrain,2.82,2022 est.,226,Middle East
226,Kuwait,kuwait,2.25,2022 est.,227,Middle East
227,United Arab Emirates,united-arab-emirates,1.56,2022 est.,228,Middle East
228,Qatar,qatar,1.42,2022 est.,229,Middle East

In [8]:
# top / bottom
DFcsv1.head(10) #tail()

,name,slug,value,date_of_information,ranking,region
0,Afghanistan,afghanistan,104.89,NaN,1,South Asia
1,Somalia,somalia,86.53,NaN,2,Africa
2,Central African Republic,central-african-republic,82.97,NaN,3,Africa
3,Equatorial Guinea,equatorial-guinea,78.33,NaN,4,Africa
4,Sierra Leone,sierra-leone,73.42,NaN,5,Africa
5,Niger,niger,66.81,NaN,6,Africa
6,Chad,chad,65.48,NaN,7,Africa
7,South Sudan,south-sudan,63.18,NaN,8,Africa
8,Mozambique,mozambique,61.38,NaN,9,Africa
9,"Congo, Democratic Republic of the",congo-democratic-republic-of-the,60.85,NaN,10,Africa

In [9]:
# top / bottom
DFcsv1.tail(10)

,name,slug,value,date_of_information,ranking,region
217,Czechia,czechia,2.40,NaN,218,Europe
218,Norway,norway,2.31,NaN,219,Europe
219,Sweden,sweden,2.30,NaN,220,Europe
220,Bermuda,bermuda,2.19,NaN,221,North America
221,Finland,finland,2.13,NaN,222,Europe
222,Japan,japan,1.90,NaN,223,East and Southeast Asia
223,Monaco,monaco,1.76,NaN,224,Europe
224,Iceland,iceland,1.65,NaN,225,Europe
225,Singapore,singapore,1.55,NaN,226,East and Southeast Asia
226,Slovenia,slovenia,1.52,NaN,227,Europe

In [10]:
# top / bottom
DFcsv2.head(10)

,name,slug,value,date_of_information,ranking,region
0,Yemen,yemen,39.9,2013,1,Middle East
1,Timor-Leste,timor-leste,37.5,2013,2,East and Southeast Asia
2,India,india,33.4,2016/18,3,South Asia
3,Sudan,sudan,33.0,2014,4,Africa
4,Niger,niger,31.3,2019,5,Africa
5,Djibouti,djibouti,29.9,2012,6,Africa
6,Chad,chad,29.2,2019,7,Africa
7,Papua New Guinea,papua-new-guinea,27.8,2009/11,8,East and Southeast Asia
8,Burundi,burundi,27.0,2018/19,9,Africa
9,Madagascar,madagascar,26.4,2018,10,Africa

In [ ]:
# top / bottom
DFcsv2.head(10)

In [11]:
# top / bottom
DFcsv2.tail(10)

,name,slug,value,date_of_information,ranking,region
120,Belgium,belgium,1.0,2014/15,121,Europe
121,Serbia,serbia,1.0,2019,122,Europe
122,North Macedonia,north-macedonia,0.9,2018/19,123,Europe
123,Tonga,tonga,0.8,2019,124,Australia and Oceania
124,Poland,poland,0.7,2010/12,125,Europe
125,Chile,chile,0.5,2014,126,South America
126,Germany,germany,0.5,2014/17,127,Europe
127,Estonia,estonia,0.4,2013/15,128,Europe
128,Portugal,portugal,0.4,2015/16,129,Europe
129,United States,united-states,0.4,2017/18,130,North America

In [12]:
# top / bottom
DFcsv3.head(10)

        name       slug  value date_of_information  ranking        region
0     Serbia     serbia  16.39           2022 est.        1        Europe
1    Romania    romania  15.26           2022 est.        2        Europe
2  Lithuania  lithuania  15.12           2022 est.        3        Europe
3     Latvia     latvia  14.65           2022 est.        4        Europe
4   Bulgaria   bulgaria  14.41           2022 est.        5        Europe
5    Ukraine    ukraine  13.77           2022 est.        6        Europe
6     Russia     russia  13.36           2022 est.        7  Central Asia
7    Estonia    estonia  13.10           2022 est.        8        Europe
8    Belarus    belarus  12.88           2022 est.        9        Europe
9    Croatia    croatia  12.88           2022 est.       10        Europe

In [13]:
# top / bottom
DFcsv3.tail(10)

,name,slug,value,date_of_information,ranking,region
219,Jordan,jordan,3.45,2022 est.,220,Middle East
220,Libya,libya,3.45,2022 est.,221,Africa
221,Saudi Arabia,saudi-arabia,3.42,2022 est.,222,Middle East
222,West Bank,west-bank,3.40,2022 est.,223,Middle East
223,Oman,oman,3.23,2022 est.,224,Middle East
224,Gaza Strip,gaza-strip,2.91,2022 est.,225,Middle East
225,Bahrain,bahrain,2.82,2022 est.,226,Middle East
226,Kuwait,kuwait,2.25,2022 est.,227,Middle East
227,United Arab Emirates,united-arab-emirates,1.56,2022 est.,228,Middle East
228,Qatar,qatar,1.42,2022 est.,229,Middle East

In [14]:
DFcsv1.columns

Index(['name', 'slug', 'value', 'date_of_information', 'ranking', 'region'], dtype='object')

In [15]:
DFcsv2.columns

Index(['name', 'slug', 'value', 'date_of_information', 'ranking', 'region'], dtype='object')

In [16]:
DFcsv3.columns

Index(['name', 'slug', 'value', 'date_of_information', 'ranking', 'region'], dtype='object')

In [18]:
DFcsv1.iloc[:,4]

0        1
1        2
2        3
3        4
4        5
      ...
222    223
223    224
224    225
225    226
226    227
Name: ranking, Length: 227, dtype: int64

In [19]:
bye=[1,4]
DFcsv1.drop(columns=DFcsv1.columns[bye],inplace=True)
DFcsv1

,name,value,date_of_information,region
0,Afghanistan,104.89,NaN,South Asia
1,Somalia,86.53,NaN,Africa
2,Central African Republic,82.97,NaN,Africa
3,Equatorial Guinea,78.33,NaN,Africa
4,Sierra Leone,73.42,NaN,Africa
...,...,...,...,...
222,Japan,1.90,NaN,East and Southeast Asia
223,Monaco,1.76,NaN,Europe
224,Iceland,1.65,NaN,Europe
225,Singapore,1.55,NaN,East and Southeast Asia
226,Slovenia,1.52,NaN,Europe

In [20]:
bye=[1,4]
DFcsv2.drop(columns=DFcsv2.columns[bye],inplace=True)
DFcsv2

              name  value date_of_information                   region
0            Yemen   39.9                2013              Middle East
1      Timor-Leste   37.5                2013  East and Southeast Asia
2            India   33.4             2016/18               South Asia
3            Sudan   33.0                2014                   Africa
4            Niger   31.3                2019                   Africa
..             ...    ...                 ...                      ...
125          Chile    0.5                2014            South America
126        Germany    0.5             2014/17                   Europe
127        Estonia    0.4             2013/15                   Europe
128       Portugal    0.4             2015/16                   Europe
129  United States    0.4             2017/18            North America

[130 rows x 4 columns]

In [21]:
bye=[1,4]
DFcsv3.drop(columns=DFcsv3.columns[bye],inplace=True)
DFcsv3

                     name  value date_of_information       region
0                  Serbia  16.39           2022 est.       Europe
1                 Romania  15.26           2022 est.       Europe
2               Lithuania  15.12           2022 est.       Europe
3                  Latvia  14.65           2022 est.       Europe
4                Bulgaria  14.41           2022 est.       Europe
..                    ...    ...                 ...          ...
224            Gaza Strip   2.91           2022 est.  Middle East
225               Bahrain   2.82           2022 est.  Middle East
226                Kuwait   2.25           2022 est.  Middle East
227  United Arab Emirates   1.56           2022 est.  Middle East
228                 Qatar   1.42           2022 est.  Middle East

[229 rows x 4 columns]

In [37]:
DFcsv1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 227 entries, 0 to 226
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   name                 227 non-null    object
 1   value                227 non-null    float64
 2   date_of_information  0 non-null      float64
 3   region               227 non-null    object
dtypes: float64(2), object(2)
memory usage: 7.2+ KB

In [42]:
DFcsv2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 130 entries, 0 to 129
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   name                 130 non-null    object
 1   value                130 non-null    float64
 2   date_of_information  130 non-null    object
 3   region               130 non-null    object
dtypes: float64(1), object(3)
memory usage: 4.2+ KB

In [43]:
DFcsv3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 229 entries, 0 to 228
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   name                 229 non-null    object
 1   value                229 non-null    float64
 2   date_of_information  229 non-null    object
 3   region               229 non-null    object
dtypes: float64(1), object(3)
memory usage: 7.3+ KB

In [64]:
DFcsv1.rename(columns = {'name':'country', 'value':'infantmortalityrate', 'date_of_information':'dateofinformation' }, inplace = True)
DFcsv1

,country,infant mortality rate,dateofinformation,region
0,Afghanistan,104.89,NaN,South Asia
1,Somalia,86.53,NaN,Africa
2,Central African Republic,82.97,NaN,Africa
3,Equatorial Guinea,78.33,NaN,Africa
4,Sierra Leone,73.42,NaN,Africa
...,...,...,...,...
222,Japan,1.90,NaN,East and Southeast Asia
223,Monaco,1.76,NaN,Europe
224,Iceland,1.65,NaN,Europe
225,Singapore,1.55,NaN,East and Southeast Asia
226,Slovenia,1.52,NaN,Europe

In [62]:
DFcsv2.rename(columns = {'name':'country', 'value':'childrenunder5underweight', 'date_of_information':'dateofinformation' }, inplace = True)
DFcsv2

,country,childrenunder5underweight,dateofinformation,region
0,Yemen,39.9,2013,Middle East
1,Timor-Leste,37.5,2013,East and Southeast Asia
2,India,33.4,2016/18,South Asia
3,Sudan,33.0,2014,Africa
4,Niger,31.3,2019,Africa
...,...,...,...,...
125,Chile,0.5,2014,South America
126,Germany,0.5,2014/17,Europe
127,Estonia,0.4,2013/15,Europe
128,Portugal,0.4,2015/16,Europe
129,United States,0.4,2017/18,North America

In [65]:
DFcsv3.rename(columns = {'name':'country', 'value':'deathrate', 'date_of_information':'dateofinformation' }, inplace = True)
DFcsv3

                  country  deathrate dateofinformation       region
0                  Serbia      16.39         2022 est.       Europe
1                 Romania      15.26         2022 est.       Europe
2               Lithuania      15.12         2022 est.       Europe
3                  Latvia      14.65         2022 est.       Europe
4                Bulgaria      14.41         2022 est.       Europe
..                    ...        ...               ...          ...
224            Gaza Strip       2.91         2022 est.  Middle East
225               Bahrain       2.82         2022 est.  Middle East
226                Kuwait       2.25         2022 est.  Middle East
227  United Arab Emirates       1.56         2022 est.  Middle East
228                 Qatar       1.42         2022 est.  Middle East

[229 rows x 4 columns]

In [72]:
print(DFcsv1.duplicated())

0      False
1      False
2      False
3      False
4      False
       ...
222    False
223    False
224    False
225    False
226    False
Length: 227, dtype: bool

In [73]:
print(DFcsv2.duplicated())

0      False
1      False
2      False
3      False
4      False
       ...
125    False
126    False
127    False
128    False
129    False
Length: 130, dtype: bool

In [74]:
print(DFcsv3.duplicated())

0      False
1      False
2      False
3      False
4      False
       ...
224    False
225    False
226    False
227    False
228    False
Length: 229, dtype: bool

## formatting

In [76]:
DFcsv1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 227 entries, 0 to 226
Data columns (total 4 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   country                227 non-null    object
 1   infant mortality rate  227 non-null    float64
 2   dateofinformation      0 non-null      float64
 3   region                 227 non-null    object
dtypes: float64(2), object(2)
memory usage: 7.2+ KB

In [77]:
DFcsv2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 130 entries, 0 to 129
Data columns (total 4 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   country                    130 non-null    object
 1   childrenunder5underweight  130 non-null    float64
 2   dateofinformation          130 non-null    object
 3   region                     130 non-null    object
dtypes: float64(1), object(3)
memory usage: 4.2+ KB

In [78]:
DFcsv3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 229 entries, 0 to 228
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   country            229 non-null    object
 1   deathrate          229 non-null    float64
 2   dateofinformation  229 non-null    object
 3   region             229 non-null    object
dtypes: float64(1), object(3)
memory usage: 7.3+ KB

In [81]:
DFcsv3.dateofinformation[DFcsv3.dateofinformation.str.contains('\D',regex=True)]

0      2022 est.
1      2022 est.
2      2022 est.
3      2022 est.
4      2022 est.
         ...
224    2022 est.
225    2022 est.
226    2022 est.
227    2022 est.
228    2022 est.
Name: dateofinformation, Length: 229, dtype: object

In [82]:
DFcsv3.dateofinformation.str.replace(' est.','',regex=False)

0      2022
1      2022
2      2022
3      2022
4      2022
       ...
224    2022
225    2022
226    2022
227    2022
228    2022
Name: dateofinformation, Length: 229, dtype: object